<a href="https://colab.research.google.com/github/xuhu357/DataAnalysis/blob/master/%EB%8D%B0%EC%9D%B4%ED%84%B0_%EC%A4%80%EB%B9%84%ED%95%98%EA%B8%B0_4.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

### 피버팅으로 데이터 나열하기

데이터베이스나 csv파일에 여러 개의 시계열 데이터를 저장하는 일반적인 방법은 시간수느로 나열하는 방법입니다.

In [1]:
from google.colab import files

uploaded = files.upload()

for fn in uploaded.keys():
  print('User uploaded file "{name}" with length {length} bytes'.format(
      name=fn, length=len(uploaded[fn])))

Saving macrodata.csv to macrodata.csv
User uploaded file "macrodata.csv" with length 18242 bytes

데이터를 간단하게 살펴보자~

In [1]:
!head macrodata.csv

year,quarter,realgdp,realcons,realinv,realgovt,realdpi,cpi,m1,tbilrate,unemp,pop,infl,realint
1959.0,1.0,2710.349,1707.4,286.898,470.045,1886.9,28.98,139.7,2.82,5.8,177.146,0.0,0.0
1959.0,2.0,2778.801,1733.7,310.859,481.301,1919.7,29.15,141.7,3.08,5.1,177.83,2.34,0.74
1959.0,3.0,2775.488,1751.8,289.226,491.26,1916.4,29.35,140.5,3.82,5.3,178.657,2.74,1.09
1959.0,4.0,2785.204,1753.7,299.356,484.052,1931.3,29.37,140.0,4.33,5.6,179.386,0.27,4.06
1960.0,1.0,2847.699,1770.5,331.722,462.199,1955.5,29.54,139.6,3.5,5.2,180.007,2.31,1.19
1960.0,2.0,2834.39,1792.9,298.152,460.4,1966.1,29.55,140.2,2.68,5.2,180.671,0.14,2.55
1960.0,3.0,2839.022,1785.8,296.375,474.676,1967.8,29.75,140.9,2.36,5.6,181.528,2.7,-0.34
1960.0,4.0,2802.616,1788.2,259.764,476.434,1966.6,29.84,141.1,2.29,6.3,182.287,1.21,1.08
1961.0,1.0,2819.264,1787.7,266.405,475.854,1984.5,29.81,142.1,2.37,6.8,182.992,-0.4,2.77

In [0]:
import pandas as pd
import numpy as np

In [0]:
data = pd.read_csv('macrodata.csv')

In [4]:
data.head()

,year,quarter,realgdp,realcons,realinv,realgovt,realdpi,cpi,m1,tbilrate,unemp,pop,infl,realint
0,1959.0,1.0,2710.349,1707.4,286.898,470.045,1886.9,28.98,139.7,2.82,5.8,177.146,0.00,0.00
1,1959.0,2.0,2778.801,1733.7,310.859,481.301,1919.7,29.15,141.7,3.08,5.1,177.830,2.34,0.74
2,1959.0,3.0,2775.488,1751.8,289.226,491.260,1916.4,29.35,140.5,3.82,5.3,178.657,2.74,1.09
3,1959.0,4.0,2785.204,1753.7,299.356,484.052,1931.3,29.37,140.0,4.33,5.6,179.386,0.27,4.06
4,1960.0,1.0,2847.699,1770.5,331.722,462.199,1955.5,29.54,139.6,3.50,5.2,180.007,2.31,1.19

In [0]:
periods = pd.PeriodIndex(year=data.year, quarter=data.quarter,name='date')

In [0]:
data = pd.DataFrame(data.to_records(),
                   columns=pd.Index(['realgdp', 'infl', 'unemp'], name='item'),
                   index=periods.to_timestamp('D', 'end'))

In [7]:
data.head()

item         realgdp  infl  unemp
date
1959-03-31  2710.349  0.00    5.8
1959-06-30  2778.801  2.34    5.1
1959-09-30  2775.488  2.74    5.3
1959-12-31  2785.204  0.27    5.6
1960-03-31  2847.699  2.31    5.2

In [0]:
ldata = data.stack().reset_index().rename(columns={0:'value'})

In [9]:
ldata.head()

        date     item     value
0 1959-03-31  realgdp  2710.349
1 1959-03-31     infl     0.000
2 1959-03-31    unemp     5.800
3 1959-06-30  realgdp  2778.801
4 1959-06-30     infl     2.340

In [10]:
data.stack()[:10]  # 너무 많으니깐 일단 앞의 10개만 보자

date        item
1959-03-31  realgdp    2710.349
            infl          0.000
            unemp         5.800
1959-06-30  realgdp    2778.801
            infl          2.340
            unemp         5.100
1959-09-30  realgdp    2775.488
            infl          2.740
            unemp         5.300
1959-12-31  realgdp    2785.204
dtype: float64

In [12]:
data.stack().reset_index()[:10]  # 너무 많으니깐 일단 앞의 10개만 보자

        date     item         0
0 1959-03-31  realgdp  2710.349
1 1959-03-31     infl     0.000
2 1959-03-31    unemp     5.800
3 1959-06-30  realgdp  2778.801
4 1959-06-30     infl     2.340
5 1959-06-30    unemp     5.100
6 1959-09-30  realgdp  2775.488
7 1959-09-30     infl     2.740
8 1959-09-30    unemp     5.300
9 1959-12-31  realgdp  2785.204

In [13]:
data.stack().reset_index().rename(columns={0:'value'})[:10]  # 너무 많으니깐 일단 앞의 10개만 보자

        date     item     value
0 1959-03-31  realgdp  2710.349
1 1959-03-31     infl     0.000
2 1959-03-31    unemp     5.800
3 1959-06-30  realgdp  2778.801
4 1959-06-30     infl     2.340
5 1959-06-30    unemp     5.100
6 1959-09-30  realgdp  2775.488
7 1959-09-30     infl     2.740
8 1959-09-30    unemp     5.300
9 1959-12-31  realgdp  2785.204

Pivot에 대해서 조금 더 알아보자~

In [14]:
ldata.head()

        date     item     value
0 1959-03-31  realgdp  2710.349
1 1959-03-31     infl     0.000
2 1959-03-31    unemp     5.800
3 1959-06-30  realgdp  2778.801
4 1959-06-30     infl     2.340

In [0]:
pivoted = ldata.pivot('date', 'item', 'value')

In [16]:
pivoted.head()

item        infl   realgdp  unemp
date
1959-03-31  0.00  2710.349    5.8
1959-06-30  2.34  2778.801    5.1
1959-09-30  2.74  2775.488    5.3
1959-12-31  0.27  2785.204    5.6
1960-03-31  2.31  2847.699    5.2

Pivot 메소드의 처음 두 인자는 각각 row와 column의 색인으로 사용 될 column 이름이고,
마지막 value는 DataFrame 에 채워 넣을 값을 담고 있는 칼럼이다. 

date는 row 인덱스, item은 column 인덱스, 그리고 보고 싶은것은 칼럼 이름에 해당 되는 value 값이다.


---

한번에 2개의 칼럼을 변형은 어떻게 할까?

In [0]:
ldata['value2'] = np.random.randn(len(ldata))

In [18]:
ldata.head()

        date     item     value    value2
0 1959-03-31  realgdp  2710.349 -0.463601
1 1959-03-31     infl     0.000 -0.945544
2 1959-03-31    unemp     5.800  0.237961
3 1959-06-30  realgdp  2778.801  0.505033
4 1959-06-30     infl     2.340 -0.401838

하나이싱의 칼럼을 변형할 때에는 마지막 인자를 생략해서 **계층적 칼럼을** 가지는 DataFrame을 얻을 수 있다.

In [19]:
pivoted = ldata.pivot(index='date', columns='item')
pivoted.head()

           value                    value2
item        infl   realgdp unemp      infl   realgdp     unemp
date
1959-03-31  0.00  2710.349   5.8 -0.945544 -0.463601  0.237961
1959-06-30  2.34  2778.801   5.1 -0.401838  0.505033 -2.221683
1959-09-30  2.74  2775.488   5.3  1.156874  0.394370 -0.653894
1959-12-31  0.27  2785.204   5.6 -0.992441 -1.040792 -1.472765
1960-03-31  2.31  2847.699   5.2 -1.036320 -0.934015 -0.230010

Actually, pivot 메소드는 set_index()를 사용해서 계층적 색인을 만들고, unstack 메소드를 이용해서 형태를 변경하는 단축키 같은 메소드이다~

뭔말일까?

In [21]:
ldata.set_index(['date', 'item'])[:10] # 마찬가지로 앞의 10개만 보자.

                       value    value2
date       item
1959-03-31 realgdp  2710.349 -0.463601
           infl        0.000 -0.945544
           unemp       5.800  0.237961
1959-06-30 realgdp  2778.801  0.505033
           infl        2.340 -0.401838
           unemp       5.100 -2.221683
1959-09-30 realgdp  2775.488  0.394370
           infl        2.740  1.156874
           unemp       5.300 -0.653894
1959-12-31 realgdp  2785.204 -1.040792

In [22]:
ldata.set_index(['date', 'item']).unstack('item')[:10]

           value                    value2
item        infl   realgdp unemp      infl   realgdp     unemp
date
1959-03-31  0.00  2710.349   5.8 -0.945544 -0.463601  0.237961
1959-06-30  2.34  2778.801   5.1 -0.401838  0.505033 -2.221683
1959-09-30  2.74  2775.488   5.3  1.156874  0.394370 -0.653894
1959-12-31  0.27  2785.204   5.6 -0.992441 -1.040792 -1.472765
1960-03-31  2.31  2847.699   5.2 -1.036320 -0.934015 -0.230010
1960-06-30  0.14  2834.390   5.2 -1.172802 -1.496641 -1.531088
1960-09-30  2.70  2839.022   5.6  1.698571 -1.842454  0.357492
1960-12-31  1.21  2802.616   6.3  1.640677 -0.054465  1.324392
1961-03-31 -0.40  2819.264   6.8 -0.421208 -0.571590 -0.859894
1961-06-30  1.47  2872.005   7.0  0.821231  0.958653 -0.455723

In [24]:
ldata.pivot('date', 'item')[:10]  # 위의 과정과 결과가 같음을 볼 수 있음.

           value                    value2
item        infl   realgdp unemp      infl   realgdp     unemp
date
1959-03-31  0.00  2710.349   5.8 -0.945544 -0.463601  0.237961
1959-06-30  2.34  2778.801   5.1 -0.401838  0.505033 -2.221683
1959-09-30  2.74  2775.488   5.3  1.156874  0.394370 -0.653894
1959-12-31  0.27  2785.204   5.6 -0.992441 -1.040792 -1.472765
1960-03-31  2.31  2847.699   5.2 -1.036320 -0.934015 -0.230010
1960-06-30  0.14  2834.390   5.2 -1.172802 -1.496641 -1.531088
1960-09-30  2.70  2839.022   5.6  1.698571 -1.842454  0.357492
1960-12-31  1.21  2802.616   6.3  1.640677 -0.054465  1.324392
1961-03-31 -0.40  2819.264   6.8 -0.421208 -0.571590 -0.859894
1961-06-30  1.47  2872.005   7.0  0.821231  0.958653 -0.455723

## 데이터 변형

### 중복 제거하기

여러가지 이유로 DataFrame에서 중복된 로우를 발견할 수 있다.

In [0]:
data = pd.DataFrame({
    'k1': ['one'] * 3 + ['two'] * 4,
    'k2': [1, 1, 2, 3, 3, 4, 4]
})

In [26]:
data

    k1  k2
0  one   1
1  one   1
2  one   2
3  two   3
4  two   3
5  two   4
6  two   4

DataFrame의 duplicated 메소드는 각 로우가 중복인지 아닌지를 알려주는 불리언 Series를 반환함.

In [27]:
data.duplicated()

0    False
1     True
2    False
3    False
4     True
5    False
6     True
dtype: bool

drop_duplicates()는 duplicated 배열이 False인 DataFrame을 반환한다.

In [28]:
data.drop_duplicates()

    k1  k2
0  one   1
2  one   2
3  two   3
5  two   4

위의 두 메소드는 기본적으로 **모든 칼럼**에 적용되며, 중복을 찾아내기 위한 부분합을 따로 지정해줄수도 있다.

In [0]:
data['v1'] = range(7) # 새로운 칼럼 추가

In [30]:
data

    k1  k2  v1
0  one   1   0
1  one   1   1
2  one   2   2
3  two   3   3
4  two   3   4
5  two   4   5
6  two   4   6

k1 칼럼에 기반해서 중복를 걸려내볼까?

In [31]:
data.drop_duplicates(subset=['k1'])

    k1  k2  v1
0  one   1   0
3  two   3   3

duplicated()와 drop_duplicates()는 기본적으로 처음 발견된 값을 유지(keep) 한다. 
keep='last'로 설정하게 되면 마지막으로 발견된 값을 반환한다.

In [32]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
1  one   1   1
2  one   2   2
4  two   3   4
6  two   4   6

In [34]:
data.drop_duplicates(['k1', 'k2']) # keep='first' 일때, 기본값

    k1  k2  v1
0  one   1   0
2  one   2   2
3  two   3   3
5  two   4   5

### 함수나 매핑(mapping)을 이용해서 데이터 변형하기.

In [0]:
data = pd.DataFrame({
    'food': ['bacon', 'pulled pork', 'bacon', 'Pastrami', 'corned beef', 
             'Bacon', 'pastrami', 'honey ham', 'nova lox'],
    'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]
})

In [41]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [0]:
meat_to_animal = {
    'bacon': 'pig',
    'pulled pork': 'pig',
    'pastrami': 'cow',
    'corned beef': 'cow',
    'honey ham': 'pig',
    'nova lox': 'salmon'
}

In [0]:
data['animal'] = data['food'].map(str.lower).map(meat_to_animal)

In [44]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

map() 외에도 함수를 넘겨서 수행할 수도 있다.

In [46]:
data['animal'] = data['food'].map(lambda x: meat_to_animal[x.lower()])
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

lambda 함수는 참 재미있는 함수이다. 만약에 시간이 된다면, 한번 자세히 보는 것도 좋을듯하다.

### 값 치환하기

fillna메소드를 사용해서 누락된 값을 채우는 일은 일반적인 값 치환 작업이라고 볼 수 있다. 

위에서 보았듯이, map 메소드를 한객체안에서 값의 부분 집합을 변경하는데 사용했다면, 

replace메소는 같은 작업에 대해서 좀 더 간단하고 유연한 방법을 제공.

In [0]:
data = pd.Series([1., -999., 2., -999., -1000., 3. ])

In [48]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [49]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [50]:
# 여러개의 값을 한꺼번에 치환해버리고 싶다면, 리스트로 넘기면 된다. 

data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [51]:
# 여러개의 값을 한꺼번에 치환하고 싶은데, 일괄된 값이 아닌 각각에 맞게 치환하고 싶다면, 
# 즉 -999는 np.nan으로 -1000 은 0으로 치환하고 싶다면, 아래와 같이 대응되는 값 리스트를 넘기면 된다.

data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

두개의 리스트 대신, key:value형식이니깐 dictionary를 넘기면 된다.

In [52]:
data.replace({-999:np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

### 축의 색인 이름 바꾸기

Series의 값처럼, index역시 새롭게 값을 바꿀수 있다.

In [0]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=['Ohio', 'Colorado', 'New York'],
                    columns=['one', 'two', 'three', 'four']
                   )

In [54]:
# Series와 마찬가지로 축 index에도 map 적용이 가능

data.index.map(str.upper)

Index(['OHIO', 'COLORADO', 'NEW YORK'], dtype='object')

In [55]:
data # 결과로 확인 할 수 있겠지만, inplace는 하지 않았음.

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [0]:
# 대문자로 index를 치환하고 싶다면, 

data.index = data.index.map(str.upper)

In [57]:
data

          one  two  three  four
OHIO        0    1      2     3
COLORADO    4    5      6     7
NEW YORK    8    9     10    11

In [58]:
# 원래 객체를 변경하지 않고, 새로운 객체를 생성하려면 rename 메소드를 사용

data.rename(index=str.title, columns=str.upper)

          ONE  TWO  THREE  FOUR
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [59]:
data

          one  two  three  four
OHIO        0    1      2     3
COLORADO    4    5      6     7
NEW YORK    8    9     10    11

In [60]:
# 특히 rename 메소드는 사전 형식의 객체를 이용해서 축 이름중 일부만 변경하는 것도 가능

data.rename(index={'OHIO': 'INDIANA'}, columns={'three': 'peekaboo'})

          one  two  peekaboo  four
INDIANA     0    1         2     3
COLORADO    4    5         6     7
NEW YORK    8    9        10    11

In [61]:
data

          one  two  three  four
OHIO        0    1      2     3
COLORADO    4    5      6     7
NEW YORK    8    9     10    11

In [0]:
# 원본 데이터를 바로 변경하려면, inplace=True옵션을 주면 됨.

data.rename(index={'OHIO': 'INDIANA'}, columns={'three': 'peekaboo'}, inplace=True)

In [63]:
data

          one  two  peekaboo  four
INDIANA     0    1         2     3
COLORADO    4    5         6     7
NEW YORK    8    9        10    11

오늘은 여기까지 2019.03.09